tap "anomalyco/tap"
tap "denisidoro/tools"
tap "felixkratz/formulae"
tap "hashicorp/tap"
tap "nextfire/tap"
tap "nikitabobko/tap"
tap "steipete/tap"
tap "threedotslabs/tap"
brew "tree"
brew "ansible"
brew "python@3.13"
brew "azure-cli"
brew "bash"
brew "bat"
brew "coreutils"
brew "findutils"
brew "fzf"
brew "gh"
brew "gnu-sed"
brew "gnupg"
brew "go"
brew "goose"
brew "hyperfine"
brew "jq"
brew "k6"
brew "make"
brew "mas"
brew "mise"
brew "neovim"
brew "node"
brew "nvm"
brew "pinentry-mac"
brew "pkgconf"
brew "pnpm"
brew "pyenv"
brew "ripgrep"
brew "starship"
brew "tmux"
brew "uv"
brew "zsh"
brew "anomalyco/tap/opencode"
brew "denisidoro/tools/docpars"
brew "felixkratz/formulae/borders"
brew "hashicorp/tap/terraform"
brew "threedotslabs/tap/tdl"
cask "1password-cli"
cask "codex"
cask "steipete/tap/codexbar"
cask "font-0xproto-nerd-font"
cask "font-fira-code"
cask "font-hack-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-sf-pro"
cask "ghostty"
cask "karabiner-elements"
cask "motrix"
cask "orbstack"
cask "sf-symbols"
cask "wezterm"
mas "1Password for Safari", id: 1569813296
mas "AdBlock Pro", id: 1018301773
mas "AusweisApp", id: 948660805
mas "DaVinci Resolve", id: 571213070
mas "HP Easy Scan", id: 967004861
mas "HP Smart", id: 1474276998
mas "Infuse", id: 1136220934
mas "Keynote", id: 409183694
mas "Magnet", id: 441258766
mas "Microsoft Excel", id: 462058435
mas "Noir", id: 1592917505
mas "NordVPN", id: 905953485
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pages", id: 361309726
mas "Slack", id: 803453959
mas "Telegram", id: 747648890
mas "The Unarchiver", id: 425424353
mas "WhatsApp", id: 310633997
mas "WireGuard", id: 1451685025
vscode "4ops.terraform"
vscode "adpyke.vscode-sql-formatter"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "anthropic.claude-code"
vscode "bmewburn.vscode-intelephense-client"
vscode "boto3typed.boto3-ide"
vscode "bradlc.vscode-tailwindcss"
vscode "charliermarsh.ruff"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "codely.codely-theme"
vscode "dannysteenman.cloudformation-yaml-snippets"
vscode "dannysteenman.sam-snippets"
vscode "david1542.poetrix"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "deinsoftware.vitest-snippets"
vscode "docker.docker"
vscode "echoapi.echoapi-for-vscode"
vscode "editorconfig.editorconfig"
vscode "engineer-taro.aws-sam-snippets"
vscode "esbenp.prettier-vscode"
vscode "github.codespaces"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "gitworktrees.git-worktrees"
vscode "glavin001.unibeautify-vscode"
vscode "golang.go"
vscode "gregorbiswanger.json2ts"
vscode "hashicorp.terraform"
vscode "hyzeta.vscode-theme-github-light"
vscode "kilocode.kilo-code"
vscode "kingwl.vscode-vitest-runner"
vscode "lakshits11.best-themes-redefined"
vscode "loiane.ts-extension-pack"
vscode "matheusq94.tfs"
vscode "mechatroner.rainbow-csv"
vscode "mikestead.dotenv"
vscode "mindaro-dev.file-downloader"
vscode "mkhl.direnv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-ossdata.vscode-pgsql"
vscode "ms-python.debugpy"
vscode "ms-python.flake8"
vscode "ms-python.isort"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.vscode-speech"
vscode "ms-vsliveshare.vsliveshare"
vscode "njpwerner.autodocstring"
vscode "openai.chatgpt"
vscode "patbenatar.advanced-new-file"
vscode "pflannery.vscode-versionlens"
vscode "pjmiravalle.terraform-advanced-syntax-highlighting"
vscode "pmneo.tsimporter"
vscode "postman.postman-for-vscode"
vscode "redhat.vscode-yaml"
vscode "sleistner.vscode-fileutils"
vscode "smlombardi.slime"
vscode "streetsidesoftware.code-spell-checker"
vscode "stringham.move-ts"
vscode "stripe.vscode-stripe"
vscode "tamasfe.even-better-toml"
vscode "tylerharris.terraform-link-docs"
vscode "upstash.context7-mcp"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vitest.explorer"
vscode "vscodevim.vim"
vscode "webdevsnyc.aws-sam-snippets"
vscode "windmilleng.vscode-go-autotest"
vscode "yoavbls.pretty-ts-errors"
go "github.com/air-verse/air"
go "github.com/go-delve/delve/cmd/dlv"
go "github.com/incu6us/goimports-reviser/v3"
go "github.com/golangci/golangci-lint/cmd/golangci-lint"
go "golang.org/x/tools/gopls"
go "github.com/evilmartians/lefthook"
go "github.com/vektra/mockery/v2"
go "github.com/golang/mock/mockgen"
go "honnef.co/go/tools/cmd/staticcheck"
uv "claude-monitor"
uv "serena-agent"
uv "superclaude"
