tap "denisidoro/tools"
tap "felixkratz/formulae"
tap "homebrew/services"
tap "nextfire/tap"
tap "nikitabobko/tap"
tap "threedotslabs/tap"
brew "python@3.13"
brew "tree"
brew "ansible"
brew "bash"
brew "bat"
brew "ripgrep"
brew "codex"
brew "coreutils"
brew "deno"
brew "findutils"
brew "fzf"
brew "gh"
brew "gnu-sed"
brew "gnupg"
brew "go"
brew "goose"
brew "hyperfine"
brew "jq"
brew "k6"
brew "make"
brew "mas"
brew "neovim"
brew "nvm"
brew "pinentry-mac"
brew "pkgconf"
brew "pnpm"
brew "pyenv"
brew "tmux"
brew "uv"
brew "zsh"
brew "denisidoro/tools/docpars"
brew "felixkratz/formulae/borders"
brew "threedotslabs/tap/tdl"
cask "1password-cli"
cask "font-0xproto-nerd-font"
cask "font-fira-code"
cask "font-hack-nerd-font"
cask "font-sf-pro"
cask "karabiner-elements"
cask "orbstack"
cask "sf-symbols"
mas "1Password for Safari", id: 1569813296
mas "AdBlock Pro", id: 1018301773
mas "HP Easy Scan", id: 967004861
mas "HP Smart", id: 1474276998
mas "Infuse", id: 1136220934
mas "Keynote", id: 409183694
mas "Magnet", id: 441258766
mas "Noir", id: 1592917505
mas "NordVPN", id: 905953485
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Slack", id: 803453959
mas "The Unarchiver", id: 425424353
mas "WireGuard", id: 1451685025
vscode "adpyke.vscode-sql-formatter"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "anthropic.claude-code"
vscode "bmewburn.vscode-intelephense-client"
vscode "boto3typed.boto3-ide"
vscode "bradlc.vscode-tailwindcss"
vscode "charliermarsh.ruff"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "codely.codely-theme"
vscode "dannysteenman.cloudformation-yaml-snippets"
vscode "dannysteenman.sam-snippets"
vscode "david1542.poetrix"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "deinsoftware.vitest-snippets"
vscode "docker.docker"
vscode "editorconfig.editorconfig"
vscode "engineer-taro.aws-sam-snippets"
vscode "esbenp.prettier-vscode"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "glavin001.unibeautify-vscode"
vscode "golang.go"
vscode "gregorbiswanger.json2ts"
vscode "hyzeta.vscode-theme-github-light"
vscode "kilocode.kilo-code"
vscode "kingwl.vscode-vitest-runner"
vscode "lakshits11.best-themes-redefined"
vscode "loiane.ts-extension-pack"
vscode "mechatroner.rainbow-csv"
vscode "mikestead.dotenv"
vscode "mindaro-dev.file-downloader"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-ossdata.vscode-pgsql"
vscode "ms-python.debugpy"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.vscode-speech"
vscode "ms-vsliveshare.vsliveshare"
vscode "njpwerner.autodocstring"
vscode "openai.chatgpt"
vscode "patbenatar.advanced-new-file"
vscode "pflannery.vscode-versionlens"
vscode "pmneo.tsimporter"
vscode "redhat.vscode-yaml"
vscode "sleistner.vscode-fileutils"
vscode "smlombardi.slime"
vscode "streetsidesoftware.code-spell-checker"
vscode "stringham.move-ts"
vscode "stripe.vscode-stripe"
vscode "tamasfe.even-better-toml"
vscode "vitest.explorer"
vscode "webdevsnyc.aws-sam-snippets"
vscode "windmilleng.vscode-go-autotest"
vscode "yoavbls.pretty-ts-errors"
